# Operações com Data Frames

In [2]:
import pandas as pd

In [3]:
# Criando dicionário

stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                         index = ['Closing price', 'EPS',' Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36], 
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])}

In [4]:
type(stock)

dict

In [7]:
# Convertendo dict em DF pandas
stock_df = pd.DataFrame(stock)

In [8]:
stock_df

                          AMZN     GOOG       FB     YHOO    TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00      NaN     NaN     NaN
Beta                      0.52     0.87      NaN     0.66     NaN    0.84
Closing price           346.15  1133.43    61.48    34.90   65.25  501.53
EPS                       0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)           158.88   380.64   150.92    35.36   36.23  447.59
P/E                     589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)   459.00   335.83      NaN  1010.00  555.20  892.45

In [9]:
# Ordenação do indices do dataframe
stock_df = pd.DataFrame(stock,
                       index = ['Closing price',
                       'EPS',
                       'Shares Outstanding(M)',
                       'P/E',
                       'Market Cap(B)',
                       'Beta'])

In [10]:
stock_df.head(6)

                         AMZN     GOOG      FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43   61.48    34.90   65.25  501.53
EPS                      0.59    36.05    0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83     NaN  1010.00  555.20  892.45
P/E                    589.80    31.44  104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64  150.92    35.36   36.23  447.59
Beta                     0.52     0.87     NaN     0.66     NaN    0.84

Como o dicionário está preenchido de forma não adeuada, foram gerados valores NaN no dataframe. Para consertar isso, faremos da seguinte forma:

In [12]:
stock_df = pd.DataFrame(stock,
                       index = ['Closing price',
                       'EPS',
                       'Shares Outstanding(M)',
                       'P/E',
                       'Market Cap(B)',
                       'Beta'],
                       columns = ['AMZN', 'GOOG', 'FB'])

In [13]:
stock_df.head()

                         AMZN     GOOG      FB
Closing price          346.15  1133.43   61.48
EPS                      0.59    36.05    0.59
Shares Outstanding(M)  459.00   335.83     NaN
P/E                    589.80    31.44  104.93
Market Cap(B)          158.88   380.64  150.92

In [14]:
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [16]:
stock_df.columns

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

# Parte 2

In [17]:
Quadro_Medalhas_Olimpiada = {
    'EUA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Inglaterra':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Alemanha':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Uruguai':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [23]:
df_olimpiada = pd.DataFrame(Quadro_Medalhas_Olimpiada)

In [24]:
df_olimpiada.head(6)

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [25]:
df_olimpiada['China']

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [26]:
medalhas_China = df_olimpiada['China']

In [27]:
type(medalhas_China)

pandas.core.series.Series

In [29]:
df_olimpiada.Uruguai # outra dotação

Ouro      17
Prata     10
Bronze    15
Name: Uruguai, dtype: int64

In [31]:
df_olimpiada[['EUA', 'Alemanha']]

        EUA  Alemanha
Ouro     46        19
Prata    37        18
Bronze   38        19

In [32]:
# Utilização do metodo get()
df_olimpiada.get('Inglaterra')

Ouro      27
Prata     23
Bronze    17
Name: Inglaterra, dtype: int64

# Parte 3

#### Exercícios de Recall

In [33]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [34]:
df_olimpiada[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [35]:
df_olimpiada[2:]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [38]:
df_olimpiada[::2] # Todas as linhas e todas as colunas saltando de 2 em 2 linhas

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Bronze   38     26          17        19       15

In [39]:
df_olimpiada[::-2] # Mesma coisa, porém iniciando em Bronze

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15
Ouro     46     26          27        19       17

In [40]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [41]:
df_olimpiada.loc['Ouro']

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [42]:
df_olimpiada.loc[:,'EUA']

Ouro      46
Prata     37
Bronze    38
Name: EUA, dtype: int64

In [43]:
df_olimpiada.loc['Prata', 'China']

18

In [44]:
df_olimpiada.loc['Prata']['China']

18

In [45]:
df_olimpiada.loc['Prata']

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [47]:
df_olimpiada.loc['Ouro'] > 20 #Operações lógicas - Retorna True

EUA            True
China          True
Inglaterra     True
Alemanha      False
Uruguai       False
Name: Ouro, dtype: bool

In [51]:
#DF [LINHA, COLUNA]
df_olimpiada.loc['Ouro', df_olimpiada.loc['Ouro']>20] #Retorna as celulas e valores

EUA           46
China         26
Inglaterra    27
Name: Ouro, dtype: int64

In [54]:
# Localiza a linha de índice 0
df_olimpiada.iloc[0]

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [56]:
df_olimpiada.iloc[2]

EUA           38
China         26
Inglaterra    17
Alemanha      19
Uruguai       15
Name: Bronze, dtype: int64

In [57]:
df_olimpiada.iloc[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [58]:
df_olimpiada.iloc[2, 0:2]

EUA      38
China    26
Name: Bronze, dtype: int64

In [59]:
df_olimpiada.iloc[2:3, :]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [60]:
df_olimpiada.iloc[1,:]

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [61]:
df_olimpiada.iloc[2, 0]

38

In [62]:
# Outra forma de deletar a coluna 
del df_olimpiada['EUA']

In [63]:
df_olimpiada

        China  Inglaterra  Alemanha  Uruguai
Ouro       26          27        19       17
Prata      18          23        18       10
Bronze     26          17        19       15

In [65]:
df_olimpiada.insert(0, 'Brasil', (17,16,23))

In [67]:
df_olimpiada

        Brasil  China  Inglaterra  Alemanha  Uruguai
Ouro        17     26          27        19       17
Prata       16     18          23        18       10
Bronze      23     26          17        19       15

In [70]:
df_olimpiada.describe()

          Brasil      China  Inglaterra   Alemanha    Uruguai
count   3.000000   3.000000    3.000000   3.000000   3.000000
mean   18.666667  23.333333   22.333333  18.666667  14.000000
std     3.785939   4.618802    5.033223   0.577350   3.605551
min    16.000000  18.000000   17.000000  18.000000  10.000000
25%    16.500000  22.000000   20.000000  18.500000  12.500000
50%    17.000000  26.000000   23.000000  19.000000  15.000000
75%    20.000000  26.000000   25.000000  19.000000  16.000000
max    23.000000  26.000000   27.000000  19.000000  17.000000